Revit 2027 API
DuctFittingAndAccessoryPressureDropUIData.GetUIDataItems Method
 Gets all UI data items stored in the UI data.
Namespace: Autodesk.Revit.UI.Mechanical
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<DuctFittingAndAccessoryPressureDropUIDataItem> GetUIDataItems()
Public Function GetUIDataItems As IList(Of DuctFittingAndAccessoryPressureDropUIDataItem)
public:
IList<DuctFittingAndAccessoryPressureDropUIDataItem^>^ GetUIDataItems()
member GetUIDataItems : unit -> IList<DuctFittingAndAccessoryPressureDropUIDataItem>
Return Value
IList<DuctFittingAndAccessoryPressureDropUIDataItem>
 An array of UI data items.
See Also
Reference
DuctFittingAndAccessoryPressureDropUIData Class
Autodesk.Revit.UI.Mechanical Namespace